#!/usr/bin/python
# -*- coding: utf-8 -*-
#####################################
# File name : main.py
# Create date : 2019-08-06 22:21
# Modified date : 2019-08-07 17:04
# Author : DARREN
# Describe : not set
# Email : lzygzh@126.com
#####################################
from __future__ import division
from __future__ import print_function

from cbow import CBOW
from skipgram import SkipGram

from word2word import Word2WordVector
from word2doc import Word2DocVector
from word_cluster import WordCluster

def run_skipgram():
    vec = SkipGram()
    vec.train()

def run_cbow():
    vec = CBOW()
    vec.train()

def run_word2docvector():
    vec = Word2DocVector()
    vec.train_embedding()

def run_word2wordvector():
    vec = Word2WordVector()
    vec.train_embedding()

def show_similar_words(word, model_name):
    vec = WordCluster(model_name)
    print("model %s output:" % model_name)
    simi_words = vec.get_similar_words(word)
    for word in simi_words:
        print(word)

def show_results(word):
    print("input word: %s" % word)
    show_similar_words(word, "word2word")
    show_similar_words(word, "word2doc")
    show_similar_words(word, "skipgram")
    show_similar_words(word, "cbow")

def test_word():
    word = "中国"
    show_results(word)
    word = "美国"
    show_results(word)
    word = "教育"
    show_results(word)
    word = "疾病"
    show_results(word)
    word = "母亲"
    show_results(word)

def run_wordcluster():
    test_word()
    while 1:
        word = input('enter an word to search:').strip()
        show_results(word)

def train():
    run_cbow()
    run_skipgram()
    run_word2docvector()
    run_word2wordvector()

def run():
    train()
    run_wordcluster()

run()

'''
input word: 中国
loading model:model/word2word_wordvec.bin
model word2word output:
('重拾', 0.5042934592515317)
('习性', 0.5036652186992805)
('工业生产', 0.5036198438006716)
('低俗', 0.5031349665900399)
('菊花', 0.5031185648239106)
('高消费', 0.5028165125645854)
('超级大国', 0.502705259475698)
('输出', 0.5026985987479481)
('犹存', 0.5026485851877367)
('封建制度', 0.5026168126102043)
loading model:model/word2doc_wordvec.bin
model word2doc output:
('旅游', 0.5104768867676914)
('美国', 0.5081105207102017)
('印度', 0.5077775214127526)
('日本', 0.5074571973743243)
('公司', 0.5056472611938896)
('发展', 0.50501331503599)
('企业', 0.504748023599835)
('集团', 0.5046396769999497)
('北京', 0.5044589616050367)
('国家', 0.5042944174758776)
loading model:model/skipgram_wordvec.bin
model skipgram output:
('美国', 0.5016513575260501)
('发展', 0.5015445294194973)
('日本', 0.501530875560066)
('底物', 0.5015015487851103)
('世界', 0.5014965240672137)
('280圆', 0.5014935660450972)
('市场', 0.5014931210222707)
('茴香', 0.5014826662070342)
('经线', 0.5014821443273116)
('鸡杂', 0.5014669064912676)
loading model:model/cbow_wordvec.bin
model cbow output:
('留学生', 0.5005890442675917)
('象样', 0.5005827350345965)
('钠离子', 0.5005600988665335)
('我国', 0.5005326083906808)
('社会主义国家', 0.5005122308125924)
('凯旋', 0.5005101907006092)
('红一方面军', 0.5005048672782253)
('准噶尔', 0.5004968673642509)
('古代文学', 0.5004953609959717)
('榜单', 0.5004899259221705)
input word: 美国
loading model:model/word2word_wordvec.bin
model word2word output:
('低俗', 0.5076370510987299)
('重拾', 0.5069206306173141)
('贪渎', 0.5068927730641907)
('楚文化', 0.5062027928780232)
('高消费', 0.5059239002733023)
('狂欢', 0.5058970496136873)
('习性', 0.505694672759107)
('遗存', 0.5055382236803473)
('超级大国', 0.5055043202101156)
('解析', 0.5053400029148185)
loading model:model/word2doc_wordvec.bin
model word2doc output:
('中国', 0.512372986689561)
('美元', 0.5083068932279768)
('签证', 0.5060249146041691)
('博士伦', 0.5054345581462257)
('日本', 0.5050509354570437)
('护理', 0.5033548059655105)
('国家', 0.5033451609919409)
('印度', 0.5033150839671366)
('人民币', 0.5032968088844566)
('汇率', 0.5032706980810308)
loading model:model/skipgram_wordvec.bin
model skipgram output:
('中国', 0.501651357458902)
('日本', 0.5015409378590411)
('280圆', 0.5015300594440125)
('底物', 0.5015123730357238)
('道统', 0.5015041210142134)
('茴香', 0.501487332849641)
('经线', 0.5014768518173611)
('发现', 0.5014724714775487)
('奥运项目', 0.5014711943265664)
('这是', 0.5014709936706017)
loading model:model/cbow_wordvec.bin
model cbow output:
('花卉市场', 0.5005638896662054)
('违约', 0.5005452568998412)
('号令', 0.5005347404000943)
('意大利', 0.5005307304867339)
('领到', 0.5005230642648391)
('军费', 0.5004928632680145)
('个儿', 0.5004866215673394)
('流动性', 0.5004836597780805)
('英国', 0.5004831496283776)
('养尊处优', 0.5004777904879123)
input word: 教育
loading model:model/word2word_wordvec.bin
model word2word output:
('威胁论', 0.503455444473062)
('教育产业化', 0.5033835733206349)
('贫困家庭', 0.5032532416228934)
('中国制造', 0.5032040581614584)
('节庆', 0.5031729003287387)
('町村', 0.5029450715930512)
('课上', 0.5029173103549478)
('一盘散沙', 0.5029070116457686)
('中文系', 0.502785597106441)
('精神教育', 0.5027852881854997)
loading model:model/word2doc_wordvec.bin
model word2doc output:
('学校', 0.5116758919748902)
('学生', 0.5114757082253862)
('孩子', 0.5096415002930006)
('教师', 0.5079819790027632)
('招生', 0.5074748913244622)
('考试', 0.5072827574001798)
('家长', 0.505683022100685)
('考生', 0.5056592764998495)
('高校', 0.5054703424306765)
('课程', 0.5053790235150233)
loading model:model/skipgram_wordvec.bin
model skipgram output:
('社会', 0.5014476229452611)
('美国', 0.5014380929346216)
('中国', 0.5014332970735806)
('国家', 0.5014331228062562)
('发展', 0.5014237398367608)
('这一', 0.5014188537527396)
('学校', 0.5014067436084957)
('我国', 0.501395323826843)
('经济', 0.5013922524875092)
('2005-11-13', 0.5013864292375698)
loading model:model/cbow_wordvec.bin
model cbow output:
('行政法', 0.5005652483094302)
('新教材', 0.5005236373902494)
('种树', 0.5005191833593259)
('内城', 0.5005090128181088)
('沾上', 0.5005083474179387)
('执政', 0.5005046316757985)
('精神力量', 0.5005021928145748)
('供人', 0.5005007023446129)
('待定', 0.5004928800226053)
('过活', 0.5004922576476042)
input word: 疾病
loading model:model/word2word_wordvec.bin
model word2word output:
('生殖', 0.5072120023207912)
('胚胎干细胞', 0.5069380129305743)
('不具', 0.5057014417959611)
('克隆技术', 0.5056422551710873)
('克隆', 0.5053565872465573)
('长势', 0.5050509466160912)
('克隆人', 0.5048386319734193)
('胚胎', 0.5045234046912386)
('诊疗', 0.5044492880464241)
('法律委员会', 0.5041842648697777)
loading model:model/word2doc_wordvec.bin
model word2doc output:
('治疗', 0.5120052582130556)
('gt', 0.5099682934828291)
('患者', 0.5089289066932371)
('高血压', 0.5078147117061629)
('病人', 0.5068626135516939)
('哮喘', 0.5065718573610041)
('药物', 0.5065348131698125)
('女性', 0.5061922700797328)
('症状', 0.5057000523821692)
('医院', 0.505367132072274)
loading model:model/skipgram_wordvec.bin
model skipgram output:
('1365672', 0.5009965070956989)
('铁托', 0.5009808107989177)
('东莞市', 0.5009701656129526)
('occasion', 0.5009661058759864)
('经线', 0.5009651904894912)
('0.08', 0.500964577551692)
('用典', 0.5009560123973635)
('风月', 0.5009474279117551)
('艾滋病防治条例', 0.5009469718858329)
('碱基对', 0.500946860104294)
loading model:model/cbow_wordvec.bin
model cbow output:
('癌症', 0.5006176679999197)
('高血压', 0.5005810643650644)
('总工会', 0.5005248791022101)
('呜咽', 0.5005190933746071)
('红客', 0.5005158520642529)
('婴儿', 0.5005116887310285)
('中国科协', 0.5005011757210883)
('复习资料', 0.5004972570148012)
('移植', 0.5004966839615572)
('病人', 0.5004942584034637)
input word: 母亲
loading model:model/word2word_wordvec.bin
model word2word output:
('亲生', 0.5046418525978233)
('球星', 0.5037504594703596)
('歌星', 0.5037501603555257)
('肩挑', 0.5032749472636231)
('勇敢地', 0.5030487799381906)
('操心', 0.5029763029695897)
('寻医问药', 0.502913243173768)
('母爱', 0.5028339216106971)
('赶去', 0.5028101631566668)
('巴桑', 0.5026356203541467)
loading model:model/word2doc_wordvec.bin
model word2doc output:
('孩子', 0.5171427232250838)
('newwin', 0.5096779291683711)
('url', 0.5064401557029594)
('婴儿', 0.5059508205633184)
('皇后', 0.5053289173183919)
('乳腺癌', 0.5051975435325703)
('父母', 0.504461965297715)
('治疗', 0.5044328533189578)
('家长', 0.5040918241702881)
('疫苗', 0.5037229879319262)
loading model:model/skipgram_wordvec.bin
model skipgram output:
('铁锨', 0.5010226469088385)
('书香', 0.50102124192847)
('polo', 0.5010023288508202)
('0533', 0.500999726024484)
('清净剂', 0.5009989380228196)
('于我', 0.5009986496235466)
('升官', 0.5009878589436437)
('发行日期', 0.5009816384198644)
('奶子', 0.5009762393383221)
('每题', 0.5009742736183753)
loading model:model/cbow_wordvec.bin
model cbow output:
('艺人', 0.5006129130812924)
('自觉性', 0.5005474516653444)
('皇后', 0.500528739012556)
('听谁', 0.500524983548002)
('提及', 0.5005195759641423)
('结果却', 0.5005028601055286)
('厂址', 0.5005021453807066)
('活起来', 0.5004962409392987)
('秋山', 0.5004938018068569)
('了得', 0.5004910928168458)
'''
